# 코딩테스트란 ?
#
# - 기업/기관에서 직원이나 연수생을 선발하기 위한 목적으로 시행되는 일종의 문제 풀이 시험
# - 공개채용을 하는 기업에서는 코딩 테스트를 주로 이용합니다.
#     - 문제 해결 역량을 평가
#     - 채점 시스템을 통해 응시자의 수를 효과적으로 줄일 수 있다.
#
# 코딩 테스트의 유형
#
# - 온라인 코딩 테스트
#     - 인터넷을 활용해 프로그래밍 역량을 평가하여 응시자를 선별
#     - 대체로 타인과 문제풀이를 공유하지 않는 선에서 인터넷 검색을 허용
# - 오프라인 코딩 테스트
#     - 시험장에 방문하여 치르는 시험
#     - 대체로 인터넷 검색이 허용되지 않으며 회사에서 제공하는 컴퓨터 환경을 이용

# 온라인 저지(Online Judge)란?
#
# 해외 : 코드포스 / 탑코더 / 릿코드 / 코드셰프
# 국내 : 백준 / 코드업 / 프로그래머스 / SW Expert Academy

# 코딩 테스트 응시자 설문
# 파이썬 사용 비율 높음, 표준 라이브러리 많음